# SetTypeList Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..SetTypeList Method
IFCData Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetTypeList(
	IList<string> typeList
)
```

Visual Basic
---
```text
Public Sub SetTypeList ( _
	typeList As IList(Of String) _
)
```

Visual C++
---
```text
public:
void SetTypeList(
	IList<String^>^ typeList
)
```

# ### Parameters
typeList
    Type: System.Collections.Generic..::..IList<(Of <(<'String>)>)>
# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace